
## Plan Result (ithc)




<pre><code>Plan: 105 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY
  * azurerm_key_vault_secret.alert_action_group_name
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_key_vault_secret.envelopes_queue_listen_access_key_premium
  * azurerm_key_vault_secret.envelopes_queue_listen_conn_str_premium
  * azurerm_key_vault_secret.envelopes_queue_max_delivery_count_premium
  * azurerm_key_vault_secret.envelopes_queue_send_access_key_premium
  * azurerm_key_vault_secret.envelopes_queue_send_conn_str_premium
  * azurerm_key_vault_secret.envelopes_staging_queue_listen_access_key
  * azurerm_key_vault_secret.envelopes_staging_queue_send_access_key
  * azurerm_key_vault_secret.payments_queue_listen_access_key_premium
  * azurerm_key_vault_secret.payments_queue_listen_conn_str_premium
  * azurerm_key_vault_secret.payments_queue_send_access_key_premium
  * azurerm_key_vault_secret.payments_queue_send_conn_str_premium
  * azurerm_key_vault_secret.payments_staging_queue_listen_access_key
  * azurerm_key_vault_secret.payments_staging_queue_send_access_key
  * azurerm_key_vault_secret.processed_envelopes_queue_listen_access_key_premium
  * azurerm_key_vault_secret.processed_envelopes_queue_listen_conn_str_premium
  * azurerm_key_vault_secret.processed_envelopes_queue_send_access_key_premium
  * azurerm_key_vault_secret.processed_envelopes_queue_send_conn_str_premium
  * azurerm_key_vault_secret.processed_envelopes_staging_queue_listen_access_key
  * azurerm_key_vault_secret.processed_envelopes_staging_queue_send_access_key
  * azurerm_key_vault_secret.storage_account_connection_string
  * azurerm_key_vault_secret.storage_account_name
  * azurerm_key_vault_secret.storage_account_primary_key
  * azurerm_key_vault_secret.storage_account_staging_connection_string
  * azurerm_key_vault_secret.storage_account_staging_name
  * azurerm_key_vault_secret.storage_account_staging_primary_key
  * azurerm_resource_group.rg
  * azurerm_storage_account.storage_account
  * azurerm_storage_account.storage_account_staging
  * azurerm_storage_container.service_containers[0]
  * azurerm_storage_container.service_containers[1]
  * azurerm_storage_container.service_containers[2]
  * azurerm_storage_container.service_containers[3]
  * azurerm_storage_container.service_containers[4]
  * azurerm_storage_container.service_containers[5]
  * azurerm_storage_container.service_containers[6]
  * azurerm_storage_container.service_containers[7]
  * azurerm_storage_container.service_containers[8]
  * azurerm_storage_container.service_containers[9]
  * azurerm_storage_container.service_containers[10]
  * azurerm_storage_container.service_containers_stg[0]
  * azurerm_storage_container.service_containers_stg[1]
  * azurerm_storage_container.service_containers_stg[2]
  * azurerm_storage_container.service_containers_stg[3]
  * azurerm_storage_container.service_containers_stg[4]
  * azurerm_storage_container.service_containers_stg[5]
  * azurerm_storage_container.service_containers_stg[6]
  * azurerm_storage_container.service_containers_stg[7]
  * azurerm_storage_container.service_containers_stg[8]
  * azurerm_storage_container.service_containers_stg[9]
  * azurerm_storage_container.service_containers_stg[10]
  * azurerm_storage_container.service_rejected_containers[0]
  * azurerm_storage_container.service_rejected_containers[1]
  * azurerm_storage_container.service_rejected_containers[2]
  * azurerm_storage_container.service_rejected_containers[3]
  * azurerm_storage_container.service_rejected_containers[4]
  * azurerm_storage_container.service_rejected_containers[5]
  * azurerm_storage_container.service_rejected_containers[6]
  * azurerm_storage_container.service_rejected_containers[7]
  * azurerm_storage_container.service_rejected_containers[8]
  * azurerm_storage_container.service_rejected_containers[9]
  * azurerm_storage_container.service_rejected_containers[10]
  * azurerm_storage_container.service_rejected_containers_stg[0]
  * azurerm_storage_container.service_rejected_containers_stg[1]
  * azurerm_storage_container.service_rejected_containers_stg[2]
  * azurerm_storage_container.service_rejected_containers_stg[3]
  * azurerm_storage_container.service_rejected_containers_stg[4]
  * azurerm_storage_container.service_rejected_containers_stg[5]
  * azurerm_storage_container.service_rejected_containers_stg[6]
  * azurerm_storage_container.service_rejected_containers_stg[7]
  * azurerm_storage_container.service_rejected_containers_stg[8]
  * azurerm_storage_container.service_rejected_containers_stg[9]
  * azurerm_storage_container.service_rejected_containers_stg[10]
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.envelopes-queue-premium.azurerm_servicebus_queue.servicebus_queue
  * module.envelopes-queue-premium.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.envelopes-queue-premium.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.envelopes-staging-queue.azurerm_servicebus_queue.servicebus_queue
  * module.envelopes-staging-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.envelopes-staging-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.payments-queue-premium.azurerm_servicebus_queue.servicebus_queue
  * module.payments-queue-premium.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.payments-queue-premium.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.payments-staging-queue.azurerm_servicebus_queue.servicebus_queue
  * module.payments-staging-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.payments-staging-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.processed-envelopes-queue-premium.azurerm_servicebus_queue.servicebus_queue
  * module.processed-envelopes-queue-premium.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.processed-envelopes-queue-premium.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.processed-envelopes-staging-queue.azurerm_servicebus_queue.servicebus_queue
  * module.processed-envelopes-staging-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.processed-envelopes-staging-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.queue-namespace-premium.azurerm_servicebus_namespace.servicebus_namespace
  * module.queue-namespace-premium.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
  * module.vault.azurerm_key_vault.kv
  * module.vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.vault.azurerm_key_vault_access_policy.developer[0]
  * module.vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0]
  * module.vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.vault.azurerm_user_assigned_identity.managed_identity[0]


<details><summary>Change Result (Click me)</summary>

:warning: **The content is omitted as it is too long.** :warning:

```hcl

  # data.azurerm_key_vault_secret.source_bsp_email_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "source_bsp_email_secret" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "bulk-scan-alert-email"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY will be created
  + resource "azurerm_key_vault_secret" "AZURE_APPINSIGHTS_KEY" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "app-insights-instrumentation-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.alert_action_group_name will be created
  + resource "azurerm_key_vault_secret" "alert_action_group_name" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "alert-action-group-name"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.envelopes_queue_listen_access_key_premium will be created
  + resource "azurerm_key_vault_secret" "envelopes_queue_listen_access_key_premium" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "envelopes-queue-listen-shared-access-key-premium"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.envelopes_queue_listen_conn_str_premium will be created
  + resource "azurerm_key_vault_secret" "envelopes_queue_listen_conn_str_premium" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "envelopes-queue-listen-connection-string-premium"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.envelopes_queue_max_delivery_count_premium will be created
  + resource "azurerm_key_vault_secret" "envelopes_queue_max_delivery_count_premium" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "envelopes-queue-max-delivery-count-premium"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.envelopes_queue_send_access_key_premium will be created
  + resource "azurerm_key_vault_secret" "envelopes_queue_send_access_key_premium" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "envelopes-queue-send-shared-access-key-premium"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.envelopes_queue_send_conn_str_premium will be created
  + resource "azurerm_key_vault_secret" "envelopes_queue_send_conn_str_premium" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "envelopes-queue-send-connection-string-premium"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.envelopes_staging_queue_listen_access_key will be created
  + resource "azurerm_key_vault_secret" "envelopes_staging_queue_listen_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "envelopes-staging-queue-listen-shared-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.envelopes_staging_queue_send_access_key will be created
  + resource "azurerm_key_vault_secret" "envelopes_staging_queue_send_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "envelopes-staging-queue-send-shared-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.payments_queue_listen_access_key_premium will be created
  + resource "azurerm_key_vault_secret" "payments_queue_listen_access_key_premium" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "payments-queue-listen-shared-access-key-premium"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.payments_queue_listen_conn_str_premium will be created
  + resource "azurerm_key_vault_secret" "payments_queue_listen_conn_str_premium" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "payments-queue-listen-connection-string-premium"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.payments_queue_send_access_key_premium will be created
  + resource "azurerm_key_vault_secret" "payments_queue_send_access_key_premium" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "payments-queue-send-shared-access-key-premium"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.payments_queue_send_conn_str_premium will be created
  + resource "azurerm_key_vault_secret" "payments_queue_send_conn_str_premium" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "payments-queue-send-connection-string-premium"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.payments_staging_queue_listen_access_key will be created
  + resource "azurerm_key_vault_secret" "payments_staging_queue_listen_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "payments-staging-queue-listen-shared-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.payments_staging_queue_send_access_key will be created
  + resource "azurerm_key_vault_secret" "payments_staging_queue_send_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "payments-staging-queue-send-shared-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.processed_envelopes_queue_listen_access_key_premium will be created
  + resource "azurerm_key_vault_secret" "processed_envelopes_queue_listen_access_key_premium" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "processed-envelopes-queue-listen-shared-access-key-premium"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.processed_envelopes_queue_listen_conn_str_premium will be created
  + resource "azurerm_key_vault_secret" "processed_envelopes_queue_listen_conn_str_premium" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "processed-envelopes-queue-listen-connection-string-premium"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.processed_envelopes_queue_send_access_key_premium will be created
  + resource "azurerm_key_vault_secret" "processed_envelopes_queue_send_access_key_premium" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "processed-envelopes-queue-send-shared-access-key-premium"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.processed_envelopes_queue_send_conn_str_premium will be created
  + resource "azurerm_key_vault_secret" "processed_envelopes_queue_send_conn_str_premium" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "processed-envelopes-queue-send-connection-string-premium"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.processed_envelopes_staging_queue_listen_access_key will be created
  + resource "azurerm_key_vault_secret" "processed_envelopes_staging_queue_listen_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "processed-envelopes-staging-queue-listen-shared-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.processed_envelopes_staging_queue_send_access_key will be created
  + resource "azurerm_key_vault_secret" "processed_envelopes_staging_queue_send_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "processed-envelopes-staging-queue-send-shared-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.storage_account_connection_string will be created
  + resource "azurerm_key_vault_secret" "storage_account_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "storage-account-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.storage_account_name will be created
  + resource "azurerm_key_vault_secret" "storage_account_name" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "storage-account-name"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.storage_account_primary_key will be created
  + resource "azurerm_key_vault_secret" "storage_account_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "storage-account-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.storage_account_staging_connection_string will be created
  + resource "azurerm_key_vault_secret" "storage_account_staging_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "storage-account-staging-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.storage_account_staging_name will be created
  + resource "azurerm_key_vault_secret" "storage_account_staging_name" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "storage-account-staging-name"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.storage_account_staging_primary_key will be created
  + resource "azurerm_key_vault_secret" "storage_account_staging_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "storage-account-staging-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "bulk-scan-ithc"
      + tags     = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "ithc"
          + "managedBy"           = "Bulk Scanning and Printing"
        }
    }

  # azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "ukso

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ning_enabled                    = false
      + requires_duplicate_detection            = false
      + requires_session                        = false
      + status                                  = "Active"
    }

  # module.payments-staging-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "ListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.payments-staging-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "SendSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.processed-envelopes-queue-premium.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "bulk-scan-servicebus-ithc-premium"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "bulk-scan-ithc"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
    }

  # module.processed-envelopes-queue-premium.azurerm_servicebus_queue.servicebus_queue will be created
  + resource "azurerm_servicebus_queue" "servicebus_queue" {
      + auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S"
      + batched_operations_enabled              = true
      + dead_lettering_on_message_expiration    = true
      + default_message_ttl                     = "P10675199DT2H48M5.4775807S"
      + duplicate_detection_history_time_window = "PT10M"
      + express_enabled                         = false
      + id                                      = (known after apply)
      + lock_duration                           = "PT5M"
      + max_delivery_count                      = 10
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = 1024
      + name                                    = "processed-envelopes"
      + namespace_id                            = (known after apply)
      + partitioning_enabled                    = false
      + requires_duplicate_detection            = false
      + requires_session                        = false
      + status                                  = "Active"
    }

  # module.processed-envelopes-queue-premium.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "ListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.processed-envelopes-queue-premium.azurerm_servicebus_queue_authorization_rule.send_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "SendSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.processed-envelopes-staging-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "bulk-scan-servicebus-ithc-premium"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "bulk-scan-ithc"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
    }

  # module.processed-envelopes-staging-queue.azurerm_servicebus_queue.servicebus_queue will be created
  + resource "azurerm_servicebus_queue" "servicebus_queue" {
      + auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S"
      + batched_operations_enabled              = true
      + dead_lettering_on_message_expiration    = true
      + default_message_ttl                     = "P10675199DT2H48M5.4775807S"
      + duplicate_detection_history_time_window = "PT10M"
      + express_enabled                         = false
      + id                                      = (known after apply)
      + lock_duration                           = "PT5M"
      + max_delivery_count                      = 10
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = 1024
      + name                                    = "processed-envelopes-staging"
      + namespace_id                            = (known after apply)
      + partitioning_enabled                    = false
      + requires_duplicate_detection            = false
      + requires_session                        = false
      + status                                  = "Active"
    }

  # module.processed-envelopes-staging-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "ListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.processed-envelopes-staging-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "SendSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.queue-namespace-premium.azurerm_servicebus_namespace.servicebus_namespace will be created
  + resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      + capacity                            = 0
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + local_auth_enabled                  = true
      + location                            = "uksouth"
      + minimum_tls_version                 = "1.2"
      + name                                = "bulk-scan-servicebus-ithc-premium"
      + premium_messaging_partitions        = 0
      + public_network_access_enabled       = true
      + resource_group_name                 = "bulk-scan-ithc"
      + sku                                 = "Standard"
      + tags                                = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "ithc"
          + "managedBy"           = "Bulk Scanning and Printing"
        }

      + network_rule_set (known after apply)
    }

  # module.queue-namespace-premium.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule will be created
  + resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "SendAndListenSharedAccessKey"
      + namespace_id                      = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.vault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "bulk-scan-ithc"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "bulk-scan-ithc"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "ithc"
          + "managedBy"           = "Bulk Scanning and Printing"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.vault.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.vault.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0] will be created
  + resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.vault.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "70de400b-4f47-4f25-a4f0-45e1ee4e4ae3"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "bulk-scan-ithc"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "AuditEvent"
            # (1 unchanged attribute hidden)
        }
    }

  # module.vault.azurerm_user_assigned_identity.managed_identity[0] will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "bulk-scan-ithc-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-ithc-rg"
      + tags                = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "ithc"
          + "managedBy"           = "Bulk Scanning and Printing"
        }
      + tenant_id           = (known after apply)
    }

Plan: 105 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + action_group_name           = "BSP Alert (ithc)"
  + storage_account_name        = "bulkscanithc"
  + storage_account_primary_key = (sensitive value)
  + vaultName                   = "bulk-scan-ithc"
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":309,"Program":"tfcmt","SHA1":"","Target":"ithc","Vars":{}} -->